In [1]:
#!pip install pandas==2.0.0
import pandas as pd
import numpy as np
pd.__version__

'1.4.4'

# Import data frames

In [2]:
df1=pd.read_csv("games.csv")

In [3]:
df2=pd.read_csv("games2.csv")

In [4]:
df3=pd.read_csv("games3.csv")

In [5]:
df1.head()

      games
0  16074318
1  16074082
2  16074142
3  16074156
4  16074360

## Check lenght dataframes

In [6]:
len(df1)+len(df2)+len(df3)

227278

## Concat dataframes and set index

In [7]:
# Concatenate multiple DataFrames (df1, df2, df3, df4, df5, df6, df7) along the vertical axis (axis=0) into 'klix_df'
chess_df=pd.concat([df1,df2,df3], axis=0)

In [9]:
# Check the length of the DataFrame
len(chess_df)

227278

In [11]:
# Displaying the first few rows of the DataFrame
chess_df.head()

      games
0  16074318
1  16074082
2  16074142
3  16074156
4  16074360

In [12]:
# Set the index of 'klix_df' to a new range of integers starting from 0 to match the updated DataFrame length
chess_df.index=np.arange(0,len(chess_df))

## Check for garbage in the DataFrame

In [13]:
# Find and display duplicate rows in the DataFrame
chess_df[chess_df.duplicated()]

       games
182561     G
182562     r
182563     e
182564     s
182565     k
...      ...
225655     r
225656     e
225657     s
225658     k
225659     a

[120 rows x 1 columns]

In [15]:
# Filter rows in DataFrame where the "text" column is equal to "Greska"
chess_df[chess_df["games"]=="Greska"]

Empty DataFrame
Columns: [games]
Index: []

In [17]:
# Check for NaN values in the 'title' column
isna=klix_df['title'].isna()

In [18]:
# Display rows with NaN values in the 'title' column
klix_df[isna]

,title,link,article_class,article_class_name,num_of_comments,num_of_shares,picture_path,text
646354,NaN,NaN,NaN,NaN,0,0,NaN,NaN
696045,NaN,NaN,NaN,NaN,0,0,NaN,NaN
745966,NaN,NaN,NaN,NaN,0,0,NaN,NaN

## Data Cleaning and Preprocessing

In [19]:
# Remove duplicate rows while keeping the first occurrence
klix_df=klix_df.drop_duplicates(keep="first")

In [20]:
# Drop rows with NaN values in the 'title' column
klix_df=klix_df.drop(klix_df[isna].index)

C:\Users\salih\AppData\Local\Temp\ipykernel_11252\2467278091.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  klix_df=klix_df.drop(klix_df[isna].index)

In [21]:
# Drop rows where the 'text' column has the value 'Greska'
klix_df=klix_df.drop(klix_df[klix_df["text"]=="Greska"].index)

In [22]:
# Check the lenght of the DataFrame
len(klix_df)

786758

## Save dataframe

In [ ]:
klix_df.to_csv('dataframes/klix_df.csv',index=False, encoding='utf-8')